/*
Создать функцию, которая будет менять первый элемент массива на последний и последний на первый

reverse([1, 2, 4]) // должно вернуть [4, 2, 1]
---------------------------------------
Создать объект, который будет представлять информацию о компании.
Он должен иметь поля: companyName, companyCreatedYear, amountOfPeople, companyHead.
Добавить метод, который будет выводить сколько лет компании. Теперешний год можно узнать с помощью выражения new Date().getFullYear()
Добавить метод, который будет вычислять сколько будет сотрудников через N лет, учитывая что каждый год прибавляется 100 сотрудников.
Добавить метод, который будет выводить всю информацию о компании.
--------------------------
Создать Html файл, в который через JS будет добавляться информация о компании. Каждое поле это блок с именем поля и значением
-------------------------
Выполнить задание по поиску элементов из этой ссылки https://learn.javascript.ru/searching-elements-dom Задание в конце статьи
-------------------------
Выполнить задание по выделению ячейки по диагонали из этой ссылки https://learn.javascript.ru/dom-navigation Задание в конце статьи
*/
